Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
    #define MAX_EXPECT_LIST 10
    if(!found)
    {
        if(listOfExpectedAnswer.size() < MAX_EXPECT_LIST)
        {


            ExpectAnswer toWaitAnswerElem(pNode, packet_type, request, cb, tag, max_retry, expectPayload, size);
            listOfExpectedAnswer.push_back(toWaitAnswerElem);
            sendCommand(request);
        }
        else PRTLN("MAX_EXPECT_LIST reached");
    }
    #if SHOW_EXPECT_EVENT
    #endif
    else  PRTLN("Already in Expected list");
}
//void SpidermeshApi::





void SpidermeshApi::CheckIfAnswerWasExpectedAndCallSuccessFunction(apiframe rxPkt)
{
  #if SHOW_EXPECT_EVENT
    //Serial.println("CheckIfAnswerWasExpectedAndCallSuccessFunction()");
  #endif    
    //check if there is something to expect
    if(listOfExpectedAnswer.size() > 0)
    {
        std::list<ExpectAnswer>::iterator i = listOfExpectedAnswer.begin();

          #if SHOW_EXPECT_EVENT
            Serial.print("rxPkt: ");
            printApiPacket(rxPkt);
          #endif            


        // for all expected answer recorded
        while (i != listOfExpectedAnswer.end())
        {
            //if packet is local
            if(rxPkt[3] != PACKET_REMOTE_ANSWER)
            {
                if((i->_packet_type | 0x10) == rxPkt[3])
                {
                    #if SHOW_EXPECT_EVENT
                        Serial.println(" = expect local match found ");
                    #endif
                        i->_expect_callback(i->_pNode, rxPkt, true, i->_tag);
                        i=listOfExpectedAnswer.erase(i);
                    #if SHOW_EXPECT_EVENT
                        Serial.println(" = callback done");
                    #endif
    
                        break;
                }
            }
            //since it is remote check the remote packet type futher
            
            else if((i->_packet_type | 0x10) == (rxPkt[6] & 0x7F))
            {
              #if SHOW_EXPECT_EVENT
                Serial.println("  = remote packet match");
              #endif

                //PRTLN("PACKET REMOTE RESP");
                u_mac add_rx;


                add_rx.bOff[byte0]=rxPkt[7];
                add_rx.bOff[byte1]=rxPkt[8];
                add_rx.bOff[byte2]=rxPkt[9];
                add_rx.bOff[byte3]=0;

                //Serial.println("  address cmp:" + String(add_rx.address) + "   exp:" + String(i->_pNode.second.mac.address));
                //if address and packet type match, we found the good one
                
                if(add_rx.address== i->_pNode->second.mac.address)
                {

                    #if SHOW_EXPECT_EVENT
                        Serial.println(" == expect match found");
                    #endif

                    #if MODBUS_REGISTER_ENABLED
                    Helper::PollPacketToModbusRegister(i->_pNode, rxPkt);
                    #endif

                    i->_expect_callback(i->_pNode, rxPkt, true, i->_tag);

                     i->_pNode->second.dataValid = true;
                  #if SHOW_EXPECT_EVENT
                    Serial.println("  data validity TRUE  <----------" + i->_pNode->second.name);
                  #endif

                    i=listOfExpectedAnswer.erase(i);

                    break;
                }
            }

            i++;
        }
    }
}


//rfPayloadToJsonFromPacket(i->_idx);



//a chaque EOB, incrémente les compteur de EOB pour tout les nodes qui attende un message. 
//si il a 2 EOB sans réponse, la meme requete peut etre envoyé de nouveau si le nombre de retry est >0
//apres le nombre de retry sans réponse, le node est considéré comme dead
// 

void SpidermeshApi::CheckExpectTimeout()
{
  #if SHOW_EXPECT_EVENT
    //Serial.println("CheckExpectTimeout()"); delay(100);
  #endif
    
    if(listOfExpectedAnswer.size() > 0)
    {
        
        auto i = listOfExpectedAnswer.begin();

        while (i != listOfExpectedAnswer.end())
        {
            if( (++i->_eob_cnt) >2)
            {
                //Serial.println("Expect failed, reach max EOB");
                i->_eob_cnt=0;
                i->_nb_eob_recv++;

                //retry if less than max allowed and data was valid last time
                //we don't want to retry if it was already dead and waste time here
              #if SHOW_EXPECT_EVENT
                Serial.println("  retry count is:" + String(i->_nb_eob_recv));
              #endif
                if(i->_nb_eob_recv > i->_max_nb_eob_recv)
                {
                    apiframe dummy;
                  #if SHOW_EXPECT_EVENT
                    Serial.println("  data validity FALSE <---- " + i->_pNode->second.name);
                  #endif
                     i->_pNode->second.dataValid=false;
                    i->_expect_callback(i->_pNode, dummy, false, i->_tag);//if user want to do something

                    i=listOfExpectedAnswer.erase(i);
                }
                else
                {
                    lowPriorityFifoCommandList.push_back(i->_request);
                    #if SHOW_EXPECT_EVENT
                    Serial.println( i->_pNode->second.name + " retry no: " + String(i->_nb_eob_recv) + " of " + String(i->_max_nb_eob_recv));
                    #endif
                }
            }
            //Serial.print("  expect list sz:");
            //Serial.println(listOfExpectedAnswer.size());
            if(i != listOfExpectedAnswer.end()) i++;
        }
        
    }
                    
}


void SpidermeshApi::automaticNodePolling()
{
    static bool current_focus_cycle = true;
  #if SHOW_AUTOMATIC_POLLING
    Serial.print("automaticNodePolling() mode:");
    Serial.println(polling_mode);
  #endif

    //if there are nodes to poll
    if(nodes.pool.size() > 1) //we check if more than one since gateway is the first
    {
        apiframe smkPacket;
        //bool must_increase_polling_iterator = false;
        mesh_t::iterator pPoll = nodes.pool.end();

        unsigned long seconds = millis()/1000;

        //check if the node to poll is already in the list expected to avoid multiple retry of the same node
        bool isnt_already_in_expect_list = true;
        for(auto x : listOfExpectedAnswer) {
            if(x._pNode->first == pCurrentNode->first)
            {
                isnt_already_in_expect_list = false;
                break;
            }
        } 

        if(focus_node != 0)
        {
            uint64_t toComp = (millis() - focus_node_start_time)/1000;
            if(toComp < _duration_focus_on_node_polling)
            {
              #if SHOW_AUTOMATIC_POLLING
                Serial.print("focus polling on");
                Serial.println(SmkList::mac2String(focus_node));
              #endif          

                //current_focus_cycle allow to toggle 1/2 time on a specific node 
                //while allowing to continue the round robin cycle on the other 1/2 of time
                if(current_focus_cycle)
                {
                    pPoll = find(focus_node);
                    if(pPoll == nodes.pool.end()) current_focus_cycle = false;
                }
                else
                {
                    if(polling_mode == "time" || polling_mode == "fast")
                    {
                        //must_increase_polling_iterator = true;
                        findNext();
                        pPoll = pCurrentNode;
                    }
                    else pPoll != nodes.pool.end();
                    current_focus_cycle = true;
                }
            }

